---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BasepointAngletonParam
source: html/4fbd98d2-f956-c9fb-d294-c29e69c539a1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BasepointAngletonParam Property

"Angle to True North"

## Syntax (C#)
```csharp
public static ForgeTypeId BasepointAngletonParam { get; }
```